# Project Title
### Udacity Data Engineering Capstone Project

#### Project Summary
* The immigration data for the United States will be examined in this Project.
##### DataSets

### 1 - I94 Immigration Data:
This data comes from the US National Tourism and Trade Office. A data dictionary is included in the workspace. .[this](https://travel.trade.gov/research/reports/i94/historical/2016.html) is where the data comes from. There's a sample file so you can take a look at the data in csv format before reading it all in. You do not have to use the entire dataset, just use what you need to accomplish the goal you set at the beginning of the project.

### 2 - World Temperature Data: 
This dataset came from Kaggle. You can read more about it [here](https://www.kaggle.com/berkeleyearth/climate-change-earth-surface-temperature-data) .

### 3 - U.S. City Demographic Data: 
This data comes from OpenSoft. You can read more about it [here](https://public.opendatasoft.com/explore/dataset/us-cities-demographics/export/) .

### 4 - Airport Code Table: 
This is a simple table of airport codes and corresponding cities. It comes from  [here](https://datahub.io/core/airport-codes#data) .


The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [1]:
# Do all imports and installs here
# Import Libraries
import pandas as pd
import  psycopg2 as ps
# Import models
from sql_queries import airport_table_insert,demographic_table_insert,immigration_table_insert,temperature_table_insert

### Step 1: Scope the Project and Gather Data

#### Scope 
Explain what you plan to do in the project in more detail. What data do you use? What is your end solution look like? What tools did you use? etc>

#### Describe and Gather Data 
Describe the data sets you're using. Where did it come from? What type of information is included?

### 1 - Immigration Data
This data comes from the US National Tourism and Trade Office. A data dictionary is included in the workspace. 
 [This](https://travel.trade.gov/research/reports/i94/historical/2016.html) is where the data comes from. There's a sample file so you can take a look at the data in csv format before reading it all in. You do not have to use the entire dataset, just use what you need to accomplish the goal you set at the beginning of the project.

In [2]:
# Read in the data here
pd.set_option('display.max_columns', 20) #reduce columns to 20 columns
immigration_file = 'data/immigration_data_sample.csv' # Data File Lcation Name
immigration_df = pd.read_csv(immigration_file,low_memory=False) # Read Data with reduce  memory usage

In [3]:
immigration_df.shape # Show Data Shape

(1000, 29)

In [4]:
immigration_df.columns #show Data Columns

Index(['Unnamed: 0', 'cicid', 'i94yr', 'i94mon', 'i94cit', 'i94res', 'i94port',
       'arrdate', 'i94mode', 'i94addr', 'depdate', 'i94bir', 'i94visa',
       'count', 'dtadfile', 'visapost', 'occup', 'entdepa', 'entdepd',
       'entdepu', 'matflag', 'biryear', 'dtaddto', 'gender', 'insnum',
       'airline', 'admnum', 'fltno', 'visatype'],
      dtype='object')

In [5]:
# show first row
immigration_df.head(1)

,Unnamed: 0,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,...,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,2027561,4084316.0,2016.0,4.0,209.0,209.0,HHW,20566.0,1.0,HI,...,NaN,M,1955.0,07202016,F,NaN,JL,5.658267e+10,00782,WT

### 2 - World Temperature Data:

This dataset came from Kaggle. You can read more about it .[here](https://www.kaggle.com/berkeleyearth/climate-change-earth-surface-temperature-data)

In [6]:
f_name = 'data/GlobalLandTemperaturesByCity.csv'      # Data File Lcation Name
temperature_df = pd.read_csv(f_name,low_memory=False) # Read Data with reduce  memory usage

In [7]:
temperature_df.shape # Show Data Shape

(8599212, 7)

In [8]:
temperature_df.columns # Show Data Columns

Index(['dt', 'AverageTemperature', 'AverageTemperatureUncertainty', 'City',
       'Country', 'Latitude', 'Longitude'],
      dtype='object')

In [9]:
temperature_df.head(1) # show first row

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Ã…rhus,Denmark,57.05N,10.33E

### 3 - U.S. City Demographic Data:

This data comes from OpenSoft. You can read more about it [here](https://public.opendatasoft.com/explore/dataset/us-cities-demographics/export/)

In [10]:
f_name='data/us-cities-demographics.csv'# Data File Lcation Name
demographic_df = pd.read_csv(f_name, delimiter=";",low_memory=False)# Read Data with reduce  memory sage

In [11]:
demographic_df.shape # Show Data Shape

(2891, 12)

In [12]:
demographic_df.columns  # Show Data Columns

Index(['City', 'State', 'Median Age', 'Male Population', 'Female Population',
       'Total Population', 'Number of Veterans', 'Foreign-born',
       'Average Household Size', 'State Code', 'Race', 'Count'],
      dtype='object')

In [13]:
demographic_df.head(1) #get first row

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.6,MD,Hispanic or Latino,25924

### 4 - Airport Code Table:

This is a simple table of airport codes and corresponding cities. It comes from [here](https://public.opendatasoft.com/explore/dataset/us-cities-demographics/export/)

In [14]:
f_name ='data/airport-codes_csv.csv'# Data File Lcation Name
airport_codes_df = pd.read_csv(f_name,low_memory=False)# Read Data with reduce  memory sage

In [15]:
airport_codes_df.shape # Show Data Shape

(55075, 12)

In [16]:
airport_codes_df.columns # Show Data Columns

Index(['ident', 'type', 'name', 'elevation_ft', 'continent', 'iso_country',
       'iso_region', 'municipality', 'gps_code', 'iata_code', 'local_code',
       'coordinates'],
      dtype='object')

In [17]:
airport_codes_df.head(1) # get first row

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,Bensalem,00A,NaN,00A,"-74.93360137939453, 40.07080078125"

In [18]:
# from pyspark.sql import SparkSession

# spark = SparkSession.builder.\
# config("spark.jars.repositories", "https://repos.spark-packages.org/").\
# config("spark.jars.packages", "saurfang:spark-sas7bdat:2.0.0-s_2.11").\
# enableHiveSupport().getOrCreate()

# df_spark = spark.read.format('com.github.saurfang.sas.spark').load('../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat')

In [19]:
#write to parquet
# df_spark.write.parquet("sas_data")
# df_spark=spark.read.parquet("sas_data")

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

# 1 - Immigration Data

In [20]:
immigration_df.shape

(1000, 29)

 #  2 - World Temperature Data

In [21]:
temperature_df.shape

(8599212, 7)

In [22]:
temperature_us_df =temperature_df[temperature_df['Country'] == 'United States']

In [23]:
temperature_us_df['Country'].nunique() # Data ahpr contain (8599212 rows , 7 columns)

1

In [24]:
temperature_us_df.shape # Reduce Data From (8599212 rows, 7 columns) To (687289 rows, 7 columns)

(687289, 7)

In [25]:
temperature_us_df.isnull().sum() # sum null vale in each column

dt                                   0
AverageTemperature               25765
AverageTemperatureUncertainty    25765
City                                 0
Country                              0
Latitude                             0
Longitude                            0
dtype: int64

In [26]:
# drop all rows with null value
temperature_us_df= temperature_us_df.dropna(subset=['AverageTemperature','AverageTemperatureUncertainty'])

In [27]:
temperature_us_df.isnull().sum() # Check Null Values

dt                               0
AverageTemperature               0
AverageTemperatureUncertainty    0
City                             0
Country                          0
Latitude                         0
Longitude                        0
dtype: int64

In [28]:
temperature_us_df.shape # data shape reduce from (687289 rows , 7 columns) to (661524 rows ,7 columns)

(661524, 7)

In [29]:
# get data duplicated length
len(temperature_us_df[temperature_us_df[['City','dt']].duplicated()])

21875

In [30]:
#delete all dupliacated values and update dataset
temperature_us_df = temperature_us_df.drop_duplicates(subset=['City','dt'])

In [31]:
temperature_us_df.shape # data shape reduce from (661524 rows ,7 columns) to (639649 rows , 7 columns)

(639649, 7)

In [32]:
temperature_us_df.head(1) # Show First Row

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
47555,1820-01-01,2.101,3.217,Abilene,United States,32.95N,100.53W

# 3 - Demographic Data

In [33]:
demographic_df.shape # Show Data Shape

(2891, 12)

In [34]:
demographic_df.isnull().sum() #Sum Null Value In Every Column

City                       0
State                      0
Median Age                 0
Male Population            3
Female Population          3
Total Population           0
Number of Veterans        13
Foreign-born              13
Average Household Size    16
State Code                 0
Race                       0
Count                      0
dtype: int64

In [35]:
demographic_df.dropna(inplace=True) # Drop Rows With Null Values

In [36]:
demographic_df.isnull().sum()# Check Null Values

City                      0
State                     0
Median Age                0
Male Population           0
Female Population         0
Total Population          0
Number of Veterans        0
Foreign-born              0
Average Household Size    0
State Code                0
Race                      0
Count                     0
dtype: int64

In [37]:
demographic_df.shape

(2875, 12)

# 4 - Airport Code Table

In [38]:
airport_codes_df.shape # get data shape

(55075, 12)

In [39]:
# Get Data Just For Us 
airport_codes_df = airport_codes_df[airport_codes_df['iso_country'] == 'US']

In [40]:
airport_codes_df.shape # Reduce Data From  (55075 Rows, 12 Columns) To (22757 Rows, 12 Columns)

(22757, 12)

In [41]:
airport_codes_df.isnull().sum() # Sum Data Null Values

ident               0
type                0
name                0
elevation_ft      239
continent       22756
iso_country         0
iso_region          0
municipality      102
gps_code         1773
iata_code       20738
local_code       1521
coordinates         0
dtype: int64

In [42]:
airport_codes_df.dropna(subset=['iata_code'], inplace=True) # Delete Rows With iata_code Null Values

In [43]:
airport_codes_df.isnull().sum() # Check Null Values

ident              0
type               0
name               0
elevation_ft      34
continent       2019
iso_country        0
iso_region         0
municipality       6
gps_code          81
iata_code          0
local_code        50
coordinates        0
dtype: int64

In [44]:
airport_codes_df.shape # Reduce Data From   (22757 Rows, 12 Columns) To  (2019 Rows, 12 Columns)

(2019, 12)

In [45]:
airport_codes_df.head(1) # Show First Row

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
440,07FA,small_airport,Ocean Reef Club Airport,8.0,NaN,US,US-FL,Key Largo,07FA,OCA,07FA,"-80.274803161621, 25.325399398804"

# 5 - Get port locations

In [46]:
# Get port locations from SAS text file
with open("data/I94_SAS_Labels_Descriptions.SAS") as f:
    content = f.readlines()
content = [x.strip() for x in content]
ports = content[302:962]
splitted_ports = [port.split("=") for port in ports]
port_codes = [x[0].replace("'","").strip() for x in splitted_ports]
port_locations = [x[1].replace("'","").strip() for x in splitted_ports]
port_cities = [x.split(",")[0] for x in port_locations]
port_states = [x.split(",")[-1] for x in port_locations]
df_port_locations = pd.DataFrame({"port_code" : port_codes, "port_city": port_cities, "port_state": port_states})
df_port_locations.head(1)

  port_code port_city port_state
0       ALC     ALCAN         AK

In [47]:
# Merge airport_codes_df With df_port_locations To Gert Data On iata_code and port_code
airport_codes_df= airport_codes_df.merge(df_port_locations, left_on="iata_code", right_on="port_code")
airport_codes_df.head(1)

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates,port_code,port_city,port_state
0,57A,seaplane_base,Tokeen Seaplane Base,NaN,NaN,US,US-AK,Tokeen,57A,TKI,57A,"-133.32699585, 55.9370994568",TKI,TOKEEN,AK

In [48]:
airport_codes_df.drop(columns=["port_code"], inplace=True)
airport_codes_df = airport_codes_df[["iata_code", "name", "type", "local_code", "coordinates", "port_city", "elevation_ft", "continent", "iso_country", "iso_region", "municipality", "gps_code"]]

In [49]:
airport_codes_df.head(1) # Show First Row

,iata_code,name,type,local_code,coordinates,port_city,elevation_ft,continent,iso_country,iso_region,municipality,gps_code
0,TKI,Tokeen Seaplane Base,seaplane_base,57A,"-133.32699585, 55.9370994568",TOKEEN,NaN,NaN,US,US-AK,Tokeen,57A

In [50]:
# Get irregular Port
irregular_ports_df = df_port_locations[df_port_locations["port_city"] == df_port_locations["port_state"]]
irregular_ports = list(set(irregular_ports_df["port_code"].values))
print(irregular_ports[:5])

['ISP', 'OAI', '060', 'SCH', 'AKT']

In [51]:
# Delete all irregular ports from immigration_df data
df_immigration_filtered = immigration_df[~immigration_df["i94port"].isin(irregular_ports)]

In [52]:
# Drop "insnum", "entdepu", "occup", "visapost" Columns 
df_immigration_filtered = df_immigration_filtered.drop(columns=["Unnamed: 0","insnum", "entdepu", "occup", "visapost"])
# Drop Rows With Null Value
df_immigration_filtered =df_immigration_filtered.dropna()

In [53]:
df_immigration_filtered.head(1)

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,...,entdepa,entdepd,matflag,biryear,dtaddto,gender,airline,admnum,fltno,visatype
0,4084316.0,2016.0,4.0,209.0,209.0,HHW,20566.0,1.0,HI,20573.0,...,G,O,M,1955.0,07202016,F,JL,5.658267e+10,00782,WT

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
Map out the conceptual data model and explain why you chose that model

# 1 - Immigrations - Fact Table
* `1-cicid 2-year 3-month 4-cit 5-res `
* `6-iata 7-arrdate 8-mode 9-addr 10-depdate `
* `11-bir 12-visa 13-coun 14-dtadfil 15-visapost `
* `16-occup 17-entdepa 18-entdepd 19-entdepu`
* `20-matflag 21-biryear 22-dtaddto 23-gender 24-insnum 25-airline`
* `26-admnum 27-fltno 28-visatype`

# 2 - Airports - Dimension Table

* 1 - `iata_code`
* 2 - `name` 
* 3 - `type` 
* 4 - `local_code` 
* 5 - `coordinates` 
* 6 - `city`

# 3 - Demographics - Dimension Table

* 1  - `city`
* 2  - `state` 
* 3  - `media_age` 
* 4  - `male_population` `
* 5  - `female_population` 
* 6  - `total_population` 
* 7  - `num_veterans` 
* 8  - `foreign_born` 
* 9  - `average_household_size` 
* 10 - `state_code` 
* 11 - `race` 
* 12 - `count`

# 4 - Temperature - Dimension Table

* 1  - `timestamp`
* 2  - `average_temperature` 
* 3  - `average_temperatur_uncertainty` 
* 4  - `male_population` `
* 5  - `city` 
* 6  - `country` 
* 7  - `latitude` 
* 8  - `longitude`

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model

#### 1 - Extract Data
#### 2 - Describe and Show Data 
#### 3 - Transformation Data 
#### 4 - Run create_tables.py 
#### 5 - Load Data Into DataBase

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [54]:
%run create_tables.py

Start Create Database and Tables...
Create New DataBase...
Drop Tables If Exists...
Create New Tables...
Close Connection...
Congratelaution, Finished Create DataBase And Tables.. ):

In [55]:
# Connect To us_immigration DataBase To Run Query And Load Data
conn = ps.connect("host=127.0.0.1 dbname=us_immigration user=postgres password=postgre")
cur = conn.cursor() # Object To Execute Query

In [56]:
# Insert immigration Data Using Insert Sql Query in  'immigration_table_insert' Variable
try:
    for index, row in df_immigration_filtered.iterrows():
        cur.execute(immigration_table_insert, list(row.values))
        conn.commit()
except ps.Error as e:
     print("Error" + e)

In [57]:
# Insert demographic Data Using Insert Sql Query in  'demographic_table_insert' Variable
try:
    for index, row in demographic_df.iterrows():
        cur.execute(demographic_table_insert, list(row.values))
        conn.commit()
except ps.Error as e:
    print("Error" + e)

In [58]:
# Insert Airports Codes Data Using Insert Sql Query in  'airport_table_insert' Variable
try:
    for index, row in airport_codes_df.iterrows():
        cur.execute(airport_table_insert, list(row.values))
        conn.commit()
except ps.Error as e:
    print("Error" + e)

In [59]:
# Select Specific Rows Numbers to Reduce Insert Time
temperature_us_df = temperature_us_df[:100000]

In [60]:
# Insert temperature Data Using Insert Sql Query in  'temperature_table_insert' Variable
try:
    for index, row in temperature_us_df.iterrows():
        cur.execute(temperature_table_insert, list(row.values))
        conn.commit()
except ps.Error as e:
     print("Error" + e)

In [61]:
conn.close()

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

In [62]:
# Perform quality checks here
# Load Sql Python Library
%load_ext sql

In [63]:
# Connect To DataBase To Run Sql Query
%sql postgresql://postgres:postgre@127.0.0.1/us_immigration

In [64]:
# Select count row number in immigrations Table
%sql SELECT COUNT(*) FROM immigrations;

 * postgresql://postgres:***@127.0.0.1/us_immigration
1 rows affected.

[(735,)]

In [65]:
# Select the first 5 row from  immigrations Table
%sql SELECT * FROM immigrations LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/us_immigration
5 rows affected.

[(4084316.0, 2016.0, 4.0, 209.0, 209.0, 'HHW', 20566.0, 1.0, 'HI', 20573.0, 61.0, 2.0, 1.0, '20160422', 'G', 'O', 'M', 1955.0, '07202016', 'F', 'JL', 56582674633.0, '00782', 'WT'),
 (4422636.0, 2016.0, 4.0, 582.0, 582.0, 'MCA', 20567.0, 1.0, 'TX', 20568.0, 26.0, 2.0, 1.0, '20160423', 'G', 'R', 'M', 1990.0, '10222016', 'M', '*GA', 94361995930.0, 'XBLNG', 'B2'),
 (1195600.0, 2016.0, 4.0, 148.0, 112.0, 'OGG', 20551.0, 1.0, 'FL', 20571.0, 76.0, 2.0, 1.0, '20160407', 'G', 'O', 'M', 1940.0, '07052016', 'M', 'LH', 55780468433.0, '00464', 'WT'),
 (5291768.0, 2016.0, 4.0, 297.0, 297.0, 'LOS', 20572.0, 1.0, 'CA', 20581.0, 25.0, 2.0, 1.0, '20160428', 'G', 'O', 'M', 1991.0, '10272016', 'M', 'QR', 94789696030.0, '00739', 'B2'),
 (1481650.0, 2016.0, 4.0, 577.0, 577.0, 'ATL', 20552.0, 1.0, 'GA', 20606.0, 51.0, 2.0, 1.0, '20160408', 'T', 'N', 'M', 1965.0, '10072016', 'M', 'DL', 736852585.0, '910', 'B2')]

In [66]:
# Select count row number in airports Table
%sql SELECT COUNT(*) FROM airports;

 * postgresql://postgres:***@127.0.0.1/us_immigration
1 rows affected.

[(266,)]

In [67]:
# Select the first 5 row from  airports Table
%sql SELECT * FROM airports LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/us_immigration
5 rows affected.

[('TKI', 'Tokeen Seaplane Base', 'seaplane_base', '57A', '-133.32699585, 55.9370994568', 'TOKEEN', nan, 'NaN', 'US', 'US-AK', 'Tokeen', '57A'),
 ('BKF', 'Lake Brooks Seaplane Base', 'seaplane_base', '5Z9', '-155.77699279785, 58.554798126221', 'No PORT Code (BKF)', 36.0, 'NaN', 'US', 'US-AK', 'Katmai National Park', '5Z9'),
 ('AXB', 'Maxson Airfield', 'small_airport', '89NY', '-75.90034, 44.312002', 'ALEXANDRIA BAY', 340.0, 'NaN', 'US', 'US-NY', 'Alexandria Bay', '89NY'),
 ('AUS', 'Austin Robert Mueller Municipal', 'closed', 'NaN', '-97.6997852325, 30.2987223546', 'AUSTIN', nan, 'NaN', 'US', 'US-TX', 'NaN', 'KAUS'),
 ('BRG', 'Whitesburg Municipal Airport', 'closed', 'NaN', '-82.8742, 37.2219', 'BURLINGTON', 1985.0, 'NaN', 'US', 'US-KY', 'Whitesburg', 'NaN')]

In [68]:
# Select count row number in demographics Table
%sql SELECT COUNT(*) FROM demographics;

 * postgresql://postgres:***@127.0.0.1/us_immigration
1 rows affected.

[(2875,)]

In [69]:
# Select the first 5 row from  demographics Table
%sql SELECT * FROM demographics LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/us_immigration
5 rows affected.

[('Silver Spring', 'Maryland', 33.8, 40601, 41862, 82463, 1562, 30908, 2.6, 'MD', 'Hispanic or Latino', 25924),
 ('Quincy', 'Massachusetts', 41.0, 44129, 49500, 93629, 4147, 32935, 2.39, 'MA', 'White', 58723),
 ('Hoover', 'Alabama', 38.5, 38040, 46799, 84839, 4819, 8229, 2.58, 'AL', 'Asian', 4759),
 ('Rancho Cucamonga', 'California', 34.5, 88127, 87105, 175232, 5821, 33878, 3.18, 'CA', 'Black or African-American', 24437),
 ('Newark', 'New Jersey', 34.6, 138040, 143873, 281913, 5829, 86253, 2.73, 'NJ', 'White', 76402)]

In [70]:
# Select count row number in temperature Table
%sql SELECT COUNT(*) FROM temperature;

 * postgresql://postgres:***@127.0.0.1/us_immigration
1 rows affected.

[(100000,)]

In [71]:
# Select the first 5 row from  temperature Table
%sql SELECT * FROM temperature LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/us_immigration
5 rows affected.

[(datetime.date(1820, 1, 1), 2.1010000000000004, 3.217, 'Abilene', 'United States', '32.95N', '100.53W'),
 (datetime.date(1820, 2, 1), 6.926, 2.853, 'Abilene', 'United States', '32.95N', '100.53W'),
 (datetime.date(1820, 3, 1), 10.767, 2.395, 'Abilene', 'United States', '32.95N', '100.53W'),
 (datetime.date(1820, 4, 1), 17.988999999999994, 2.202, 'Abilene', 'United States', '32.95N', '100.53W'),
 (datetime.date(1820, 5, 1), 21.809, 2.036, 'Abilene', 'United States', '32.95N', '100.53W')]

#### 4.3 Data dictionary 
Create a data dictionary for your data model. For each field, provide a brief description of what the data is and where it came from. You can include the data dictionary in the notebook or in a separate file.

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.
* Propose how often the data should be updated and why.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 * The database needed to be accessed by 100+ people.

### 1 - The data was increased by 100x.
    - Start Use
        1- Spark
        2- S3
        3- EMR

### 2 - The data populates a dashboard that must be updated on a daily basis by 7am every day.
    - Start Use Airflow

### 3 - The database needed to be accessed by 100+ people.
      - Start Use Postgresl and RedShift